bkuschak/cmsis_dap_tcp_esp32/main/commands.c
/*
 * SPDX-FileCopyrightText: Brian Kuschak <bkuschak@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 *
 * Console commands: argument parsing, handlers, and dispatch for both the
 * serial console and socket console connections.
 *
 * Serial console registers the handlers once, at boot, via the ordinary
 * esp_console_cmd_register()/esp_console_start_repl() path. Socket can't
 * do that (esp_console doesn't support multiple instances), so socket
 * commands are handled separately.
 */

#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <inttypes.h>
#include "sdkconfig.h"

#include "esp_console.h"
#include "esp_ota_ops.h"
#include "argtable3/argtable3.h"
#include "driver/uart.h"
#include "linenoise/linenoise.h"

#include "commands.h"
#include "cmsis_dap_tcp.h"
#include "uart_bridge.h"
#include "reboot.h"

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
#include "adc_stream.h"
#include "soc/soc_caps.h"
#endif

#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
#include "esp_wifi_types_generic.h"
#include "esp_netif.h"
#include "esp_netif_ip_addr.h"
#include "esp_netif_types.h"
#include "wifi.h"
#endif

#ifdef CONFIG_ESP_DAP_SOCKET_CONSOLE_ENABLED
#include <errno.h>
#include <sys/socket.h>
#include "esp_linenoise.h"
#endif

#define MAX_CMD_LINE_ARGS       32

// Shared so both consoles show the same prompt.
#define COMMANDS_PROMPT "esp32> "

// Per-caller state (own argtable instances, no locking needed): one
// persistent instance for serial, one per TCP connection for socket.
enum command_transport {
    COMMAND_TRANSPORT_SERIAL,
    COMMAND_TRANSPORT_SOCKET,
};

struct command_context {
    FILE *out;
    enum command_transport transport;

#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    struct {
        struct arg_str *ssid;
        struct arg_str *password;
        struct arg_str *auth_mode;
        struct arg_end *end;
    } wifi_args;
#endif

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    struct {
        struct arg_int *instance;
        struct arg_int *baud_rate;
        struct arg_int *data_bits;
        struct arg_str *parity;
        struct arg_int *stop_bits;
        struct arg_end *end;
    } uart_args;
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    struct {
        struct arg_int *gpio;
        struct arg_int *output_sps;
        struct arg_int *averaging;
        struct arg_str *format;
        struct arg_end *end;
    } adc_args;
#endif
};

#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
#define MAX_SSID_LEN            32
#define MAX_PASSWORD_LEN        64

static wifi_auth_mode_t parse_auth_mode(const char* auth_str)
{
    // Parse auth mode string to wifi_auth_mode_t.
    if (auth_str == NULL) {
        return WIFI_AUTH_WPA2_PSK;
    }

    if (strcmp(auth_str, "wep") == 0) {
        return WIFI_AUTH_WEP;
    } else if (strcmp(auth_str, "wpa") == 0) {
        return WIFI_AUTH_WPA_PSK;
    } else if (strcmp(auth_str, "wpa2") == 0) {
        return WIFI_AUTH_WPA2_PSK;
    } else if (strcmp(auth_str, "wpa3") == 0) {
        return WIFI_AUTH_WPA3_PSK;
    } else if (strcmp(auth_str, "open") == 0) {
        return WIFI_AUTH_OPEN;
    } else {
        return WIFI_AUTH_WPA2_PSK; // Default
    }
}

static int wifi_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    int nerrors = arg_parse(argc, argv, (void **) &ctx->wifi_args);
    if (nerrors != 0) {
        arg_print_errors(out, ctx->wifi_args.end, argv[0]);
        fprintf(out, "Usage: wifi \"<ssid>\" \"<password>\" [auth_mode]\n");
        fprintf(out, "  auth_mode: open, wep, wpa, wpa2, wpa3 (default: wpa2)\n");
        return 1;
    }

    const char* ssid = ctx->wifi_args.ssid->sval[0];
    const char* password = ctx->wifi_args.password->sval[0];
    const char* auth_mode_str = ctx->wifi_args.auth_mode->count > 0 ?
        ctx->wifi_args.auth_mode->sval[0] : "wpa2";

    // Check for empty SSID. If empty, clear stored credentials.
    if (strlen(ssid) == 0) {
        fprintf(out, "Empty SSID provided. Clearing WiFi credentials from flash.\n");
        esp_err_t err = wifi_clear_config();
        if (err == ESP_OK) {
            fprintf(out, "WiFi credentials cleared successfully.\n");
            fprintf(out, "Reboot required to use hardcoded CONFIG values.\n");
        } else {
            fprintf(out, "Error clearing WiFi credentials: %s\n",
                    esp_err_to_name(err));
            return 1;
        }
        return 0;
    }

    // Validate input lengths.
    if (strlen(ssid) >= MAX_SSID_LEN) {
        fprintf(out, "Error: SSID too long (max %d characters)\n", MAX_SSID_LEN - 1);
        return 1;
    }
    if (strlen(password) >= MAX_PASSWORD_LEN) {
        fprintf(out, "Error: Password too long (max %d characters)\n",
                MAX_PASSWORD_LEN - 1);
        return 1;
    }

    wifi_auth_mode_t auth_mode = parse_auth_mode(auth_mode_str);

    fprintf(out, "WiFi credentials received:\n");
    fprintf(out, "  SSID: %s\n", ssid);
    fprintf(out, "  Password: %s\n", password);
    fprintf(out, "  Auth mode: %s\n", auth_mode_str);

    esp_err_t err = wifi_save_config(ssid, password, auth_mode);
    if (err == ESP_OK) {
        fprintf(out, "WiFi credentials saved successfully.\n");
        fprintf(out, "Reboot required to apply new settings.\n");
    } else {
        fprintf(out, "Error saving WiFi credentials: %s\n", esp_err_to_name(err));
        return 1;
    }
    return 0;
}
#endif // CONFIG_ESP_DAP_MANAGE_WIFI

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)

// Map a UART bridge instance number (1/2/3) to the physical UART peripheral
// number it's configured to use. Returns -1 if that instance doesn't exist
// or isn't enabled.
static int uart_bridge_instance_to_uart_num(int instance)
{
    switch (instance) {
#ifdef CONFIG_ESP_UART_BRIDGE_1_ENABLED
    case 1: return CONFIG_ESP_UART_BRIDGE_1_UART_NUM;
#endif
#ifdef CONFIG_ESP_UART_BRIDGE_2_ENABLED
    case 2: return CONFIG_ESP_UART_BRIDGE_2_UART_NUM;
#endif
#ifdef CONFIG_ESP_UART_BRIDGE_3_ENABLED
    case 3: return CONFIG_ESP_UART_BRIDGE_3_UART_NUM;
#endif
    default: return -1;
    }
}

static bool parse_uart_parity(const char* parity_str, uart_parity_t* out)
{
    if (strlen(parity_str) != 1)
        return false;

    switch (toupper((unsigned char)parity_str[0])) {
        case 'N': *out = UART_PARITY_DISABLE; break;
        case 'E': *out = UART_PARITY_EVEN;    break;
        case 'O': *out = UART_PARITY_ODD;     break;
        default:  return false;
    }
    return true;
}

static int uart_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    int nerrors = arg_parse(argc, argv, (void **) &ctx->uart_args);
    if (nerrors != 0) {
        arg_print_errors(out, ctx->uart_args.end, argv[0]);
        fprintf(out, "Usage: uart <instance> <baud_rate> <data_bits> <parity> "
                "<stop_bits>\n");
        fprintf(out, "  instance: which UART bridge to configure (1, 2, or 3)\n");
        fprintf(out, "  data_bits: 7 or 8\n");
        fprintf(out, "  parity: n (none), e (even), o (odd) -- case-insensitive\n");
        fprintf(out, "  stop_bits: 1 or 2\n");
        fprintf(out, "  Use baud_rate 0 to clear stored settings and revert to "
                "CONFIG defaults.\n");
        return 1;
    }

    int instance = ctx->uart_args.instance->ival[0];
    int baud_rate = ctx->uart_args.baud_rate->ival[0];
    int data_bits = ctx->uart_args.data_bits->ival[0];
    const char* parity_str = ctx->uart_args.parity->sval[0];
    int stop_bits = ctx->uart_args.stop_bits->ival[0];

    int uart_num = uart_bridge_instance_to_uart_num(instance);
    if (uart_num < 0) {
        fprintf(out, "Error: no enabled UART bridge instance %d.\n", instance);
        return 1;
    }

    // A baud rate of 0 clears the stored settings.
    if (baud_rate == 0) {
        fprintf(out, "Clearing UART settings from flash.\n");
        esp_err_t err = uart_bridge_clear_config(uart_num);
        if (err == ESP_OK) {
            fprintf(out, "UART settings cleared successfully.\n");
            fprintf(out, "New connections will use CONFIG defaults.\n");
        } else {
            fprintf(out, "Error clearing UART settings: %s\n", esp_err_to_name(err));
            return 1;
        }
        return 0;
    }

    if (baud_rate < 0) {
        fprintf(out, "Error: baud rate must be positive.\n");
        return 1;
    }
    if (data_bits != 7 && data_bits != 8) {
        fprintf(out, "Error: data bits must be 7 or 8.\n");
        return 1;
    }
    uart_parity_t parity;
    if (!parse_uart_parity(parity_str, &parity)) {
        fprintf(out, "Error: parity must be n, e, or o.\n");
        return 1;
    }
    if (stop_bits != 1 && stop_bits != 2) {
        fprintf(out, "Error: stop bits must be 1 or 2.\n");
        return 1;
    }

    fprintf(out, "UART settings received:\n");
    fprintf(out, "  Instance: %d\n", instance);
    fprintf(out, "  UART number: %d\n", uart_num);
    fprintf(out, "  Baud rate: %d\n", baud_rate);
    fprintf(out, "  Data bits: %d\n", data_bits);
    fprintf(out, "  Parity: %s\n", parity_str);
    fprintf(out, "  Stop bits: %d\n", stop_bits);

    uart_word_length_t data_bits_enum =
            data_bits == 7 ? UART_DATA_7_BITS : UART_DATA_8_BITS;
    uart_stop_bits_t stop_bits_enum =
            stop_bits == 2 ? UART_STOP_BITS_2 : UART_STOP_BITS_1;

    esp_err_t err = uart_bridge_save_config(uart_num, baud_rate,
            data_bits_enum, parity, stop_bits_enum);
    if (err == ESP_OK) {
        fprintf(out, "UART settings saved successfully.\n");
    } else {
        fprintf(out, "Error saving UART settings: %s\n", esp_err_to_name(err));
        return 1;
    }

    err = uart_bridge_apply_live_config(uart_num, baud_rate, data_bits_enum,
            parity, stop_bits_enum);
    if (err == ESP_OK) {
        fprintf(out, "Applied immediately to UART%d.\n", uart_num);
    } else {
        fprintf(out, "Error applying settings immediately: %s\n",
                esp_err_to_name(err));
        fprintf(out, "New connections will still use the saved settings.\n");
    }
    return 0;
}
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
static bool parse_adc_format(const char* format_str, enum adc_stream_format* out)
{
    if (strcasecmp(format_str, "text") == 0) {
        *out = ADC_STREAM_FORMAT_TEXT;
        return true;
    }
    if (strcasecmp(format_str, "binary16") == 0 ||
            strcasecmp(format_str, "bin") == 0) {
        *out = ADC_STREAM_FORMAT_BINARY16;
        return true;
    }
    return false;
}

static int adc_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    int nerrors = arg_parse(argc, argv, (void **) &ctx->adc_args);
    if (nerrors != 0) {
        arg_print_errors(out, ctx->adc_args.end, argv[0]);
        fprintf(out, "Usage: adc <gpio> <output_sps> <averaging> <format>\n");
        fprintf(out, "  averaging: power of 2 from 1 to 1024 (1 = no averaging)\n");
        fprintf(out, "  format: text or binary16\n");
        fprintf(out, "  Use output_sps 0 to clear stored settings and revert to "
                "CONFIG defaults.\n");
        return 1;
    }

    int gpio = ctx->adc_args.gpio->ival[0];
    int output_sps = ctx->adc_args.output_sps->ival[0];
    int averaging = ctx->adc_args.averaging->ival[0];
    const char* format_str = ctx->adc_args.format->sval[0];

