bkuschak/cmsis_dap_tcp_esp32/main/commands.c
    // An output rate of 0 clears the stored settings. (gpio can't double as
    // the sentinel -- GPIO0 is a valid, already-default pin.)
    if (output_sps == 0) {
        fprintf(out, "Clearing ADC stream settings from flash.\n");
        esp_err_t err = adc_stream_clear_config();
        if (err == ESP_OK) {
            fprintf(out, "ADC stream settings cleared successfully.\n");
            fprintf(out, "New connections will use CONFIG defaults.\n");
        } else {
            fprintf(out, "Error clearing ADC stream settings: %s\n",
                    esp_err_to_name(err));
            return 1;
        }
        return 0;
    }

    if (output_sps < 0) {
        fprintf(out, "Error: output sample rate must be positive.\n");
        return 1;
    }
    if (averaging < 1 || averaging > 1024 ||
            (averaging & (averaging - 1)) != 0) {
        fprintf(out, "Error: averaging must be a power of 2 between 1 and 1024.\n");
        return 1;
    }
    // Same raw-rate sanity check enforced at connection time in
    // adc_stream_task() -- fail fast here instead of only at next connect.
    uint32_t raw_sample_freq_hz = (uint32_t)output_sps * (uint32_t)averaging;
    if (raw_sample_freq_hz < SOC_ADC_SAMPLE_FREQ_THRES_LOW ||
            raw_sample_freq_hz > SOC_ADC_SAMPLE_FREQ_THRES_HIGH) {
        fprintf(out, "Error: output rate (%d) x averaging (%d) = %" PRIu32
                " Hz raw ADC rate, outside the supported range (%d - %d "
                "Hz).\n", output_sps, averaging, raw_sample_freq_hz,
                SOC_ADC_SAMPLE_FREQ_THRES_LOW, SOC_ADC_SAMPLE_FREQ_THRES_HIGH);
        return 1;
    }
    enum adc_stream_format format;
    if (!parse_adc_format(format_str, &format)) {
        fprintf(out, "Error: format must be 'text' or 'binary16'.\n");
        return 1;
    }

    fprintf(out, "ADC stream settings received:\n");
    fprintf(out, "  GPIO: %d\n", gpio);
    fprintf(out, "  Output rate: %d Hz\n", output_sps);
    fprintf(out, "  Averaging: %d\n", averaging);
    fprintf(out, "  Format: %s\n", format_str);

    esp_err_t err = adc_stream_save_config(gpio, output_sps, averaging, format);
    if (err == ESP_OK) {
        fprintf(out, "ADC stream settings saved successfully.\n");
        fprintf(out, "New connections will use these settings.\n");
    } else {
        fprintf(out, "Error saving ADC stream settings: %s\n", esp_err_to_name(err));
        return 1;
    }
    return 0;
}
#endif

static const char *ota_state_str(esp_ota_img_states_t state)
{
    switch (state) {
        case ESP_OTA_IMG_NEW:            return "new";
        case ESP_OTA_IMG_PENDING_VERIFY: return "pending verify";
        case ESP_OTA_IMG_VALID:          return "valid";
        case ESP_OTA_IMG_INVALID:        return "invalid";
        case ESP_OTA_IMG_ABORTED:        return "aborted";
        default:                         return "undefined";
    }
}

// Prints one OTA slot's image info, or that it's empty.
static void print_ota_slot(FILE *out, const esp_partition_t *part,
        const esp_partition_t *running)
{
    if (part == NULL) {
        fprintf(out, "(none)\n");
        return;
    }
    fprintf(out, "%s: ", part->label);

    esp_app_desc_t desc;
    if (esp_ota_get_partition_description(part, &desc) != ESP_OK) {
        fprintf(out, "empty (%" PRIu32 " KB slot)%s\n",
                (uint32_t)(part->size / 1024), part == running ? ", running" : "");
        return;
    }
    fprintf(out, "%s, built %s %s, %" PRIu32 " KB slot", desc.version,
            desc.date, desc.time, (uint32_t)(part->size / 1024));

    esp_ota_img_states_t state;
    if (esp_ota_get_state_partition(part, &state) == ESP_OK)
        fprintf(out, ", %s", ota_state_str(state));
    if (part == running)
        fprintf(out, ", running");
    fprintf(out, "\n");
}

static int firmware_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;

    if (argc == 2 && strcmp(argv[1], "rollback") == 0) {
        const esp_partition_t *other = esp_ota_get_next_update_partition(NULL);
        esp_app_desc_t desc;
        esp_ota_img_states_t state;
        // Refuse if the other slot has no valid image, or is itself already
        // known-bad -- otherwise rollback could reboot into nothing bootable.
        if (other == NULL ||
                esp_ota_get_partition_description(other, &desc) != ESP_OK ||
                esp_ota_get_state_partition(other, &state) != ESP_OK ||
                state == ESP_OTA_IMG_INVALID || state == ESP_OTA_IMG_ABORTED) {
            fprintf(out, "No valid previous image to roll back to.\n");
            return 1;
        }
        fprintf(out, "Rolling back to '%s' (%s)...\n", other->label,
                desc.version);
        esp_ota_mark_app_invalid_rollback_and_reboot();
        fprintf(out, "Rollback failed.\n");    // only reached on failure
        return 1;
    }

    fprintf(out, "Usage: firmware rollback\n");
    return 1;
}

static int reboot_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    fprintf(ctx->out, "Rebooting...\n");
    reboot();   // Does not return.
    return 0;
}

#if defined(CONFIG_ESP_DAP_MANAGE_WIFI) && defined(CONFIG_LWIP_IPV6)
static const char* ipv6_type_str(esp_ip6_addr_type_t type)
{
    switch (type) {
        case ESP_IP6_ADDR_IS_GLOBAL:            return "global";
        case ESP_IP6_ADDR_IS_LINK_LOCAL:        return "link-local";
        case ESP_IP6_ADDR_IS_UNIQUE_LOCAL:      return "unique-local";
        case ESP_IP6_ADDR_IS_SITE_LOCAL:        return "site-local";
        case ESP_IP6_ADDR_IS_IPV4_MAPPED_IPV6:  return "ipv4-mapped";
        case ESP_IP6_ADDR_IS_UNKNOWN:
        default:                                return "unknown";
    }
}
#endif

static int status_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;

#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");

    if (netif == NULL) {
        fprintf(out, "WiFi interface not found.\n");
        return 0;
    }

    bool connected;
    const char *ssid;
    int rssi;
    wifi_get_status(&connected, &ssid, &rssi);

    if (!connected) {
        fprintf(out, "Not connected to WiFi SSID: '%s'\n", ssid);
    }
    else {
        fprintf(out, "Connected to WiFi SSID: '%s'. RSSI: %d dBm\n", ssid,
                rssi);

        esp_netif_ip_info_t ip_info;
        if (esp_netif_get_ip_info(netif, &ip_info) != ESP_OK) {
            fprintf(out, "Failed reading IP address.\n");
        }
        else {
            if (ip_info.ip.addr == 0) {
                fprintf(out, "No IP address assigned.\n");
            }
            else {
                fprintf(out, "IP address: " IPSTR "\n", IP2STR(&ip_info.ip));
            }
        }

#ifdef CONFIG_LWIP_IPV6
        esp_ip6_addr_t ip6_addrs[CONFIG_LWIP_IPV6_NUM_ADDRESSES];
        int count = esp_netif_get_all_ip6(netif, ip6_addrs);

