bkuschak/cmsis_dap_tcp_esp32/main/commands.c
        if (count == 0) {
            fprintf(out, "No IPv6 address assigned.\n");
        }
        for(int i=0; i<count; i++) {
            esp_ip6_addr_type_t ipv6_type =
                esp_netif_ip6_get_addr_type(&ip6_addrs[i]);

            fprintf(out, "IPv6 address (%s): " IPV6STR "\n",
                    ipv6_type_str(ipv6_type), IPV62STR(ip6_addrs[i]));
        }
#endif
    }
#endif // CONFIG_ESP_DAP_MANAGE_WIFI

#ifdef CONFIG_ESP_DAP_SOCKET_CONSOLE_ENABLED
    fprintf(out, "Socket console: listening on port %d.\n",
            CONFIG_ESP_DAP_SOCKET_CONSOLE_TCP_PORT);
#endif

    cmsis_dap_print_status(out);

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    uart_bridge_print_status(out);
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    adc_stream_print_status(out);
#endif

    const esp_partition_t *running = esp_ota_get_running_partition();
    const esp_partition_t *ota_0 = esp_partition_find_first(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_OTA_0, NULL);
    const esp_partition_t *ota_1 = esp_partition_find_first(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_OTA_1, NULL);
    print_ota_slot(out, ota_0, running);
    print_ota_slot(out, ota_1, running);
    return 0;
}

static int help_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    fprintf(out, "Available commands:\n");
#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    fprintf(out, "  adc <gpio> <output_sps> <averaging> <format> - Configure "
           "ADC streaming settings.\n");
#endif
    fprintf(out, "  firmware rollback - Revert to the previous firmware and reboot.\n");
    fprintf(out, "  help - Show this help message.\n");
    fprintf(out, "  reboot - Restart the device.\n");
    fprintf(out, "  status - Report device status.\n");
#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    fprintf(out, "  uart <instance> <baud_rate> <data_bits> <parity> <stop_bits> - "
           "Configure UART bridge settings.\n");
#endif
#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    fprintf(out, "  wifi \"<ssid>\" \"<password>\" [auth_mode] - Configure WiFi "
           "credentials.\n");
#endif
    return 0;
}

static struct command_context *command_context_create(enum command_transport transport,
        FILE *out)
{
    struct command_context *ctx = calloc(1, sizeof(*ctx));
    if (ctx == NULL)
        return NULL;
    ctx->out = out;
    ctx->transport = transport;

#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    ctx->wifi_args.ssid = arg_str1(NULL, NULL, "<ssid>", "WiFi network SSID");
    ctx->wifi_args.password =
        arg_str1(NULL, NULL, "<password>", "WiFi network password");
    ctx->wifi_args.auth_mode =
        arg_str0(NULL, NULL, "[auth_mode]", "Authentication mode: open, wep, "
                "wpa, wpa2, wpa3");
    ctx->wifi_args.end = arg_end(3);
#endif

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    ctx->uart_args.instance = arg_int1(NULL, NULL, "<instance>",
            "Which UART bridge to configure (1, 2, or 3)");
    ctx->uart_args.baud_rate = arg_int1(NULL, NULL, "<baud_rate>",
            "UART baud rate (0 clears stored settings)");
    ctx->uart_args.data_bits = arg_int1(NULL, NULL, "<data_bits>",
            "Data bits: 7 or 8");
    ctx->uart_args.parity = arg_str1(NULL, NULL, "<parity>",
            "Parity: n, e, o (case-insensitive)");
    ctx->uart_args.stop_bits = arg_int1(NULL, NULL, "<stop_bits>",
            "Stop bits: 1 or 2");
    ctx->uart_args.end = arg_end(5);
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    ctx->adc_args.gpio = arg_int1(NULL, NULL, "<gpio>", "ADC1 input GPIO");
    ctx->adc_args.output_sps = arg_int1(NULL, NULL, "<output_sps>",
            "Output sample rate in Hz (0 clears stored settings)");
    ctx->adc_args.averaging = arg_int1(NULL, NULL, "<averaging>",
            "Averaging count: power of 2, 1-1024");
    ctx->adc_args.format = arg_str1(NULL, NULL, "<format>",
            "Output format: text or binary16");
    ctx->adc_args.end = arg_end(4);
#endif

    return ctx;
}

#ifdef CONFIG_ESP_DAP_SOCKET_CONSOLE_ENABLED
#define MAX_CMD_LINE_LENGTH     256

// Dispatch table for process_socket_commands() (serial instead uses
// esp_console_cmd_register() in commands_init_serial()). void* matches
// esp_console_cmd_func_with_context_t, so handlers can be shared.
static const struct {
    const char *name;
    int (*func)(void *context, int argc, char **argv);
} socket_commands[] = {
#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    { "adc",    adc_cmd_handler },
#endif
    { "firmware", firmware_cmd_handler },
    { "help",   help_cmd_handler },
    { "reboot", reboot_cmd_handler },
    { "status", status_cmd_handler },
#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    { "uart",   uart_cmd_handler },
#endif
#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    { "wifi",   wifi_cmd_handler },
#endif
};
#define NUM_COMMANDS (sizeof(socket_commands) / sizeof(socket_commands[0]))

static void command_context_destroy(struct command_context *ctx)
{
    if (ctx == NULL)
        return;
#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    arg_freetable((void **)&ctx->wifi_args,
            sizeof(ctx->wifi_args) / sizeof(void *));
#endif
#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    arg_freetable((void **)&ctx->uart_args,
            sizeof(ctx->uart_args) / sizeof(void *));
#endif
#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    arg_freetable((void **)&ctx->adc_args,
            sizeof(ctx->adc_args) / sizeof(void *));
#endif
    free(ctx);
}

static void commands_run_socket(struct command_context *ctx, char *line)
{
    char *argv[MAX_CMD_LINE_ARGS];
    size_t argc = esp_console_split_argv(line, argv, MAX_CMD_LINE_ARGS);
    if (argc == 0)
        return;     // empty (or all-whitespace) line

    for (size_t i = 0; i < NUM_COMMANDS; i++) {
        if (strcmp(argv[0], socket_commands[i].name) == 0) {
            int ret = socket_commands[i].func(ctx, (int)argc, argv);
            if (ret != 0)
                fprintf(ctx->out, "Command returned non-zero error code: %d\n", ret);
            fflush(ctx->out);
            return;
        }
    }
    fprintf(ctx->out, "Unrecognized command\n");
    fflush(ctx->out);
}

static void commands_complete_socket(const char *buf, void *cb_ctx,
        void (*add)(void *cb_ctx, const char *str))
{
    size_t len = strlen(buf);
    for (size_t i = 0; i < NUM_COMMANDS; i++) {
        if (strncmp(buf, socket_commands[i].name, len) == 0)
            add(cb_ctx, socket_commands[i].name);
    }
}

