bkuschak/cmsis_dap_tcp_esp32/main/commands.c
// esp_linenoise_get_line() can't distinguish a dead connection from an
// empty line -- both return an empty string. Check the transport directly.
static bool peer_closed(transport_handle_t t)
{
    return transport_peer_closed(t);
}

// Runs one socket connection's REPL to completion. f/t remain owned by
// the caller throughout.
void process_socket_commands(FILE *f, transport_handle_t t)
{
    // Not fileno(f): f is fopencookie()-backed and has no real fd.
    int fd = transport_fd(t);
    struct command_context *ctx =
        command_context_create(COMMAND_TRANSPORT_SOCKET, f);
    if (ctx == NULL) {
        fprintf(stderr, "Command socket: out of memory creating context (fd %d).\n", fd);
        return;
    }

    esp_linenoise_config_t ln_config;
    esp_linenoise_get_instance_config_default(&ln_config);
    ln_config.prompt = COMMANDS_PROMPT;
    ln_config.max_cmd_line_length = MAX_CMD_LINE_LENGTH;
    ln_config.in_fd = fd;
    ln_config.out_fd = fd;
    ln_config.completion_cb = commands_complete_socket;
    ln_config.allow_dumb_mode = true;  // plain clients (e.g. netcat) don't speak ANSI
    ln_config.read_bytes_cb = transport_linenoise_read;
    ln_config.write_bytes_cb = transport_linenoise_write;

    esp_linenoise_handle_t handle;
    if (esp_linenoise_create_instance(&ln_config, &handle) != ESP_OK) {
        fprintf(stderr, "Command socket: failed to create linenoise instance (fd %d).\n",
                fd);
        command_context_destroy(ctx);
        return;
    }

    // Terminals that reply to the dumb-mode probe (ESC[5n) don't send that
    // reply on its own -- telnet/nc queue it and flush it together with the
    // first line the user types. Strip the resulting "[0n"/"[3n" prefix
    // (ESC already consumed as a control char) from just the first line.
    bool dumb_mode = false;
    esp_linenoise_is_dumb_mode(handle, &dumb_mode);
    bool first_line = dumb_mode;

    char line[MAX_CMD_LINE_LENGTH];
    while (1) {
        // Work around an off-by-one in esp_linenoise_dumb() that leaves a
        // stale byte from the previous line in this reused buffer.
        memset(line, 0, sizeof(line));
        esp_linenoise_get_line(handle, line, sizeof(line));
        if (peer_closed(t))
            break;
        if (first_line) {
            first_line = false;
            if (line[0] == '[' && isdigit((unsigned char)line[1]) && line[2] == 'n')
                memmove(line, line + 3, strlen(line + 3) + 1);
        }
        if (line[0] != '\0') {
            esp_linenoise_history_add(handle, line);
            commands_run_socket(ctx, line);
        }
    }

    esp_linenoise_delete_instance(handle);
    command_context_destroy(ctx);
}
#endif // CONFIG_ESP_DAP_SOCKET_CONSOLE_ENABLED

void commands_init_serial(void)
{
    // Initialize console.
    esp_console_repl_t *repl = NULL;
    esp_console_repl_config_t repl_config = ESP_CONSOLE_REPL_CONFIG_DEFAULT();
    repl_config.prompt = COMMANDS_PROMPT;
    repl_config.max_cmdline_length = 256;

#if defined(CONFIG_ESP_CONSOLE_UART_DEFAULT) || \
    defined(CONFIG_ESP_CONSOLE_UART_CUSTOM)
    esp_console_dev_uart_config_t hw_config =
        ESP_CONSOLE_DEV_UART_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_uart(&hw_config, &repl_config,
                &repl));
#elif defined(CONFIG_ESP_CONSOLE_USB_CDC)
    esp_console_dev_usb_cdc_config_t hw_config =
        ESP_CONSOLE_DEV_CDC_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_usb_cdc(&hw_config, &repl_config,
                &repl));
#elif defined(CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG)
    esp_console_dev_usb_serial_jtag_config_t hw_config =
        ESP_CONSOLE_DEV_USB_SERIAL_JTAG_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_usb_serial_jtag(&hw_config,
                &repl_config, &repl));
#else
#error "Unsupported console type!"
#endif

    // Disable the REPL's keystroke hints callback -- none of our commands
    // set .hint, so it has nothing to show and just prints garbage on some
    // terminals.
    linenoiseSetHintsCallback(NULL);

    // One context for serial's entire lifetime -- unlike socket, there's
    // only ever one registration per command, so esp_console's shared
    // table is fine here.
    struct command_context *ctx =
        command_context_create(COMMAND_TRANSPORT_SERIAL, stdout);
    if (ctx == NULL) {
        fprintf(stderr, "Serial console: out of memory creating context.\n");
        return;
    }

    printf("Enabling console commands.\n");

    // Deregister the built-in help handler so ours gets a clean slot.
    esp_console_deregister_help_command();

    // Register commands.
    const esp_console_cmd_t help_cmd = {
        .command = "help",
        .help = "Show available commands",
        .func_w_context = help_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&help_cmd));

    const esp_console_cmd_t reboot_cmd = {
        .command = "reboot",
        .help = "Restart the device",
        .func_w_context = reboot_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&reboot_cmd));

    const esp_console_cmd_t status_cmd = {
        .command = "status",
        .help = "Show device status",
        .func_w_context = status_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&status_cmd));

    const esp_console_cmd_t firmware_cmd = {
        .command = "firmware",
        .help = "firmware rollback",
        .func_w_context = firmware_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&firmware_cmd));

#ifdef CONFIG_ESP_DAP_MANAGE_WIFI
    const esp_console_cmd_t wifi_cmd = {
        .command = "wifi",
        .help = "Configure WiFi credentials",
        .func_w_context = wifi_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_cmd));
#endif

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    const esp_console_cmd_t uart_cmd = {
        .command = "uart",
        .help = "Configure UART bridge settings",
        .func_w_context = uart_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&uart_cmd));
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    const esp_console_cmd_t adc_cmd = {
        .command = "adc",
        .help = "Configure ADC streaming settings",
        .func_w_context = adc_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&adc_cmd));
#endif

    ESP_ERROR_CHECK(esp_console_start_repl(repl));
}
